Tekla Open API Reference for Tekla Structures 2025
WeldingSite Methods
The WeldFilterExpressions.WeldingSite type exposes the following members.
Methods
Name | Description
ToString
 Creates a string representation of the current object.
 (Inherited from DataFilterExpression.)
Top
See Also
Reference
WeldFilterExpressions.WeldingSite Class
Tekla.Structures.Filtering.Categories Namespace